tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "rcmdnk/file"
brew "autoconf"
brew "automake"
brew "openssl@1.1"
brew "bat"
brew "bib-tool"
brew "bison"
brew "freetype"
brew "fontconfig"
brew "gettext"
brew "glib"
brew "cairo"
brew "cmake"
brew "colordiff"
brew "libssh2"
brew "curl"
brew "deno"
brew "doxygen"
brew "gmp"
brew "libtool"
brew "pkg-config"
brew "x264"
brew "ffmpeg"
brew "flex"
brew "fondu"
brew "gcc"
brew "gd"
brew "ghq"
brew "gibo"
brew "glfw"
brew "go"
brew "gpatch"
brew "openjdk"
brew "gradle"
brew "hdf5"
brew "hdf5@1.10"
brew "htop"
brew "hub"
brew "imagemagick"
brew "jbig2dec"
brew "jq"
brew "kubernetes-cli"
brew "libzip"
brew "lsd"
brew "lua"
brew "luajit"
brew "mas"
brew "mbedtls"
brew "nkf"
brew "nmap"
brew "openblas"
brew "pastel"
brew "poppler"
brew "pdf2svg"
brew "pdftk-java"
brew "peco"
brew "pwgen"
brew "pybind11"
brew "pyenv"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "swig"
brew "the_silver_searcher"
brew "tig"
brew "tldr"
brew "utf8proc"
brew "tmux"
brew "tree"
brew "ttyrec"
brew "vim"
brew "watch"
brew "wget"
brew "yq"
cask "adobe-creative-cloud"
cask "alfred"
cask "appcleaner"
cask "bartender"
cask "blender"
cask "bluestacks"
cask "cyberduck"
cask "deepl"
cask "discord"
cask "docker"
cask "dropbox"
cask "epic-games"
cask "evernote"
cask "font-source-code-pro"
cask "geekbench"
cask "github"
cask "google-chrome"
cask "google-japanese-ime"
cask "grammarly"
cask "imageoptim"
cask "iterm2"
cask "karabiner-elements"
cask "keycastr"
cask "licecap"
cask "mactex"
cask "mathpix-snipping-tool"
cask "notion"
cask "skim"
cask "skype"
cask "slack"
cask "steam"
cask "the-unarchiver"
cask "unity-hub"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "xquartz"
cask "zoom"
mas "Irvue", id: 1039633667
mas "LINE", id: 539883307
mas "Noteshelf", id: 1488905707
mas "WinArchiver Lite", id: 414855915
mas "Xcode", id: 497799835
