tap "danielgatis/imgcat"
brew "act"
brew "aom"
brew "apache-arrow"
brew "aria2"
brew "autoconf"
brew "autoconf-archive"
brew "automake"
brew "awscli"
brew "bat"
brew "bib-tool"
brew "bison"
brew "cairo"
brew "ccache"
brew "cmake"
brew "colordiff"
brew "curl"
brew "doxygen"
brew "dvc"
brew "fd"
brew "ffmpeg"
brew "flex"
brew "fontconfig"
brew "freetype"
brew "fzf"
brew "gcc"
brew "gd"
brew "gettext"
brew "gh"
brew "ghostscript"
brew "ghq"
brew "gibo"
brew "git-filter-repo"
brew "git-lfs"
brew "glfw"
brew "glib"
brew "gmp"
brew "gnupg"
brew "gnutls"
brew "go"
brew "gpatch"
brew "guile"
brew "htop"
brew "httping"
brew "hub"
brew "hyperfine"
brew "icu4c@76"
brew "imagemagick"
brew "iproute2mac"
brew "jbig2dec"
brew "jpeg-xl"
brew "jq"
brew "kubernetes-cli"
brew "leptonica"
brew "libarchive"
brew "libassuan"
brew "libavif"
brew "libssh2"
brew "libtool"
brew "libzip"
brew "lsd"
brew "lua"
brew "luajit"
brew "neovim"
brew "ninja"
brew "nkf"
brew "nmap"
brew "open-mpi"
brew "openjdk@11"
brew "pandoc"
brew "pango"
brew "parallel"
brew "pastel"
brew "pdf2svg"
brew "pdftk-java"
brew "peco"
brew "pkgconf"
brew "poppler"
brew "pwgen"
brew "pybind11"
brew "rbenv"
brew "ripgrep"
brew "ruby-build"
brew "swig"
brew "tesseract"
brew "the_silver_searcher"
brew "tig"
brew "tldr"
brew "tmux"
brew "tree"
brew "ttyrec"
brew "unbound"
brew "utf8proc"
brew "vim"
brew "viu"
brew "watch"
brew "wget"
brew "x264"
brew "yq"
brew "zellij"
brew "zoxide"
cask "abyssoft-teleport"
cask "adobe-creative-cloud"
cask "alfred"
cask "appcleaner"
cask "bartender"
cask "blender"
cask "chatgpt-atlas"
cask "claude"
cask "cyberduck"
cask "deepl"
cask "discord"
cask "docker-desktop"
cask "dropbox"
cask "firefox"
cask "font-hack-nerd-font"
cask "font-noto-sans"
cask "font-noto-sans-cjk-jp"
cask "fujitsu-scansnap-home"
cask "geekbench"
cask "github"
cask "google-chrome"
cask "google-drive"
cask "google-japanese-ime"
cask "imageoptim"
cask "iterm2"
cask "karabiner-elements"
cask "keycastr"
cask "logitech-g-hub"
cask "mactex"
cask "mathpix-snipping-tool"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-office"
cask "microsoft-teams"
cask "notion"
cask "obs"
cask "obsidian"
cask "r-app"
cask "raycast"
cask "skim"
cask "slack"
cask "the-unarchiver"
cask "typora"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "xquartz"
cask "zoom"
cask "zotero"
cask "zulip"
vscode "aaron-bond.better-comments"
vscode "alexcvzz.vscode-sqlite"
vscode "analytic-signal.preview-tiff"
vscode "anthropic.claude-code"
vscode "asvetliakov.vscode-neovim"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "darkriszty.markdown-table-prettify"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "eliverlara.andromeda"
vscode "emilast.logfilehighlighter"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "guyskk.language-cython"
vscode "ionutvmi.path-autocomplete"
vscode "james-yu.latex-workshop"
vscode "josetr.cmake-language-support-vscode"
vscode "justusadam.language-haskell"
vscode "leanprover.lean4"
vscode "marp-team.marp-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.tensorboard"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "percy.vscode-pydata-viewer"
vscode "redhat.ansible"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "rooveterinaryinc.roo-cline"
vscode "rust-lang.rust-analyzer"
vscode "ryanluker.vscode-coverage-gutters"
vscode "saoudrizwan.claude-dev"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
vscode "zhuangtongfa.material-theme"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
cargo "agg"
cargo "bottom"
cargo "csv2json"
cargo "pueue"
cargo "sheldon"
cargo "similarity-py"
cargo "similarity-ts"
cargo "starship"
