tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
brew "autoconf"
brew "automake"
brew "bat"
brew "bib-tool"
brew "bison"
brew "freetype"
brew "fontconfig"
brew "gettext"
brew "glib"
brew "pkg-config"
brew "cairo"
brew "cmake"
brew "colordiff"
brew "libssh2"
brew "curl"
brew "doxygen"
brew "fd"
brew "gmp"
brew "openssl@1.1"
brew "x264"
brew "ffmpeg"
brew "flex"
brew "fzf"
brew "gcc"
brew "gd"
brew "jbig2dec"
brew "ghq"
brew "gibo"
brew "glfw"
brew "go"
brew "gpatch"
brew "libtool"
brew "htop"
brew "hub"
brew "imagemagick"
brew "jq"
brew "kubernetes-cli"
brew "libzip"
brew "lsd"
brew "lua"
brew "luajit"
brew "neovim"
brew "nkf"
brew "nmap"
brew "openblas"
brew "parallel"
brew "pastel"
brew "poppler"
brew "pdf2svg"
brew "pdftk-java"
brew "peco"
brew "pwgen"
brew "pybind11"
brew "pyenv"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "swig"
brew "the_silver_searcher"
brew "tig"
brew "tldr"
brew "utf8proc"
brew "tmux"
brew "tree"
brew "ttyrec"
brew "vim"
brew "watch"
brew "wget"
brew "yq"
brew "zellij"
cask "abyssoft-teleport"
cask "adobe-creative-cloud"
cask "alfred"
cask "appcleaner"
cask "bartender"
cask "blender"
cask "cyberduck"
cask "deepl"
cask "discord"
cask "docker"
cask "dropbox"
cask "font-hack-nerd-font"
cask "font-noto-sans"
cask "font-noto-sans-cjk-jp"
cask "fujitsu-scansnap-home"
cask "geekbench"
cask "github"
cask "google-chrome"
cask "google-drive"
cask "google-japanese-ime"
cask "grammarly"
cask "iterm2"
cask "karabiner-elements"
cask "keycastr"
cask "logitech-g-hub"
cask "mactex"
cask "mathpix-snipping-tool"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-office"
cask "microsoft-teams"
cask "notion"
cask "r"
cask "skim"
cask "slack"
cask "the-unarchiver"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "xquartz"
cask "zoom"
cask "zotero"
vscode "aaron-bond.better-comments"
vscode "alexcvzz.vscode-sqlite"
vscode "analytic-signal.preview-tiff"
vscode "asvetliakov.vscode-neovim"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "darkriszty.markdown-table-prettify"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "EliverLara.andromeda"
vscode "emilast.LogFileHighlighter"
vscode "formulahendry.code-runner"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "guyskk.language-cython"
vscode "ionutvmi.path-autocomplete"
vscode "James-Yu.latex-workshop"
vscode "josetr.cmake-language-support-vscode"
vscode "justusadam.language-haskell"
vscode "marp-team.marp-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "oderwat.indent-rainbow"
vscode "redhat.ansible"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "ryanluker.vscode-coverage-gutters"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "twxs.cmake"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "zhuangtongfa.material-theme"
